# max_len = 0
# max_sum = 0
# s = [2, 4, 2, 9, 8, 3, 4, 2, 1, 9, 3, 2, 8, 5, 9]
# for i in range(len(s)):
#     a=[s[i]]
#     for j in range(i+1, len(s)):
#         if s[j] in a:
#             break
#         a.append(s[j])
#     if len(a) > max_len:
#         max_len = len(a)
#         max_sum = sum(a)
# print(max_sum, max_len)
#


# На вход подаётся список:
# 14, 2, 72, 93, 45, 28, 13, 99, 27, 36, 19, 59, 15, 74, 71
#
# Напишите программу, которая выводит элементы списка,
# находящиеся между минимальным и максимальным значениями.

# nums = [14, 2, 72, 93, 45, 28, 13, 99, 27, 36, 19, 59, 15, 74, 71]
#
# min_index = nums.index(min(nums))
# max_index = nums.index(max(nums))
#
# result = nums[min_index+1:max_index]
#
# print(result)

# s = [14, 2, 72, 93, 45, 45, 13, 99, 27, 36, 19, 59, 15, 74, 71]
# index_min = 0
# for i in range(len(s)):
#     if s[i] == min(s):
#         index_min = i
#         index_max = 0
# for i in range(len(s)):
#     if s[i] == max(s):
#         index_max = i
# print(index_min, index_max)

# Самодельная метеостанция пишет температуру каждый час с 8:00 до 19:00:
# temps = [18, 19, 21, 24, 26, 28, 29, 27, 25, 22, 20, 19].
# Выведите пик жары и во сколько он был
# (индекс замера превращается в час: 8 + i),
# а также сколько часов было жарче 25 градусов.

# temps = [18, 19, 21, 24, 26, 28, 29, 27, 25, 22, 20, 19]
#
# max_temp = max(temps)
# max_index = temps.index(max_temp)
#
# count = 0
# for t in temps:
#     if t > 25:
#         count += 1
#
# print("Пик жары:", max_temp, "°C в", 8 + max_index, ":00")
# print("Часов жарче 25°C:", count)

# Журнал за десять дней:vatt = ["+", "+", "-", "+", "-", "-", "-", "+", "+", "-"].
# Если ученик пропустил три дня подряд, классный руководитель обязан позвонить родителям.
# Найдите, была ли такая серия, и с какого дня началась.

# att = ["+", "+", "-", "+", "-", "-", "-", "+", "+", "-"]
# flag=False
# for i in range(len(att)):
#     if att[i:i+3] == ['-', '-', '-']:
#         print('пропускпи начались с:', i+1)
#         flag = True
#         break
# if not flag:
#     print('пропусков нет')

# Браслет хранит два параллельных списка за неделю
# — план по шагам и факт. Посчитайте, в скольких днях план выполнен
# , и выведите счёт недели.
#
# goal = [8000, 8000, 10000, 8000, 6000, 12000, 12000]
# fact = [8500, 7200, 10100, 9000, 5900, 12500, 13000]
#
# count=0
# for i in range(len(goal)):
#     if fact[i] >= goal[i]:
#         count+=1
# print(count, sum(goal))