# Напишите программу для поиска наибольшего общего делителя.
# Наибольший общий делитель (НОД) — это число, котрое делит
# без остатка два числа и делится само без остатка на любой
# другой делитель данных двух чисел. Для нахождения НОД
# используется алгоритм Евклида. Он заключается в следующем:
#
# Большее число делится на меньшее Если большее число делится
# без остатка, то меньшее число и есть НОД Если остаток есть,
# то большее число заменяется на остаток от деления Повтаряются
# пункты 1-3 пока не будет найдет НОД

# n1=float(input("Enter a number: "))
# n2=float(input("Enter another number: "))
# if n1>n2:
#     n1, n2 = n2, n1
# while n1 !=0:
#     n2, n1 = n1, n2 % n1
# print('НОД  -',n2)

# Напишите программу вычисления факториала
# натурального числа, введённого с клавиатуры.
# Факториалом числа N называют произведение
# всех натуральных чисел до N включительно
# n=int(input())
# fact=1
# for i in range(1, n+1):
#     fact = (fact * i)
# print(fact)

#Напишите программу вычисления N-го
# элемента ряда Фибоначчи. Номер
# этого элемента (N) вводится с клавиатуры.
# Числа Фибоначчи — это ряд чисел, в котором
# каждое последующее число равно сумме двух предыдущих:
# 0, 1, 1, 2, 3, 5, 8...

# n=int(input())
# cnt=0
# a, b = 0, 1
# for i in range(2, n+1):
#     c=a+b
#     a=b
#     b=c
# print(b)

# Дана функция  15−2x−x2=y . Выведите на экран
# таблицу значений данной функции на отрезке и
# с шагом, которые вводит пользователь.
# Пользователь вводит начало диапазона,
# конец диапазона и шаг для переменной Х

# start=int(input())
# end=int(input())
# step=int(input())
# for x in range(start,end+1,step):
#     y = 15 - 2 * x - x ** 2
#     print(y)


# Напишите цикл, который переводит число из десятичной системы счисления в двоичную
# Обычно десятичное число преобразуют к двоичному представлению
# путем нахождения остатков от деления на 2.
# При этом полученное на предыдущем шаге частное выступает в качестве делимого на следующем шаге.
# Деление заканчивается, когда делимое обращается в ноль.
# Остатки собираются в двоичное число начиная с конца,
# то есть последний остаток будет первой цифрой двоичного числа.
# Например, надо перевести число 8 в двоичную систему:
# 8 / 2 = 4, остаток 0
# 4 / 2 = 2, остаток 0
# 2 / 2 = 1, остаток 0
# 1 / 2 = 0, остаток 1
# Итоговое число: 1000

# n=int(input())
# s=''
# while n!=0:
#     s=str(n%2) +s
#     n//=2
# print(s)

# Напишите программу, которая использует вложенные
# циклы for с range() для вывода пирамиды из чисел
# высотой H, где каждая строка содержит числа от 1 до номера
# строки и обратно. H вводится пользователем.
# Входные данные:
# 3
# Выходные данные:
#  1
# 121
#12321

# h = int(input())
#
# for i in range(1, h + 1):
#     print(" " * (h - i), end = "")
#     for j in range(1, i):
#         print(j, end = "")
#     for j in range(i, 0, -1):
#         print(j, end = "")
#     print()
