#Выведите на экран все числа от 0 до 10 включительно
# i = 0
# while i <= 10:
#     print(i)
#     i += 1
#
#Выведите на экран все нечётные числа от 1 до 19 включительно
# i = 1
# while i <= 19:
#     if i % 2 != 0:
#         print(i)
#     i += 1
#
#Выведите на экран все числа от 20 до 10 в обратном порядке
#i = 20
# while i >= 10:
#     print(i)
#     i -= 1
#
#С помощью цикла while выведите на экран 5 строк, каждая из которых состоит из слова "Python"
#i = 0
# while i < 5:
#     print("Python")
#     i += 1
#
#Пользователь вводит целое число. Выведите количество его разрядов (цифр)
# num = int(input("Введите целое число: "))
# num_str = str(abs(num))
# print(f"Количество разрядов: {len(num_str)}")


